stress.yml
config:
  target: "http://localhost:3000"
  http: { timeout: 60000, pool: 100 }
  phases:
    - duration: 60
      arrivalRate: 2         
    - duration: 60
      rampTo: 4
defaults:
  headers:
    content-type: application/json
    x-test-run: "true"
scenarios:
  - flow:
      - post:
          url: "/api/mail"
          json:
            nombres: "Stress-{{ $randomNumber(1000000) }}"
            apellidos: "Test-{{ $randomNumber(1000000) }}"
            correo: "lead{{ $randomNumber(1000000000) }}@example.com"
            telefono: "{{ $randomNumber(999999999) }}"
            tipoAtencion: "Stress"
            modalidad: "Virtual"
            sede: "Surco"
            turno: "Mañana"